In [13]:
# importar la lectura
import pandas as pd
import numpy as np

In [8]:
# Leer una archivo
# df abrebiatura de dataframe
df = pd.read_csv('data/datos.csv')
df

   dni   nombre  edad
0   23     juan    20
1   24    pedro    30
2   32    maria    25
3   99     jose    40
4   28   Agusto    35

In [9]:
# Leer datos con separador difernete
df_coma = pd.read_csv('data/dataexe.csv', sep=";")
df_coma

   id   nombre  edad
0   1     mari    34
1   2  juanita    28
2   3     jose    24

In [ ]:
# Cuanto suman sus edades

In [4]:
## Creando data frames
personas = {
    'Nombre': ['Juan'],
    'Edad': [23],
    'Sexo': [True]
}

df = pd.DataFrame(personas)
df

  Nombre  Edad  Sexo
0   Juan    23  True

In [38]:


df = pd.DataFrame({
            'Productivity': [
                'Balance of shift available, (h)',
                'Rows drilled out',
                'Meters drilled per shift, (m)',
                'Meters drilled per working day, (m)',
                'Meters drilled per month, (m)',
                'Metrics tons per shift, (tn)',
                'Metrics tons per working day, (tn)',
                'Metrics tons per month, (tn)'
            ],
            'Measure': [
                1, 2, 3, 4, 5, 6, 7, 8
            ]       
        }
    )

with pd.ExcelWriter('data/mydata.xlsx', engine='openpyxl') as writer:
    df.to_excel(writer, index=False)

df.to_csv('data/mydata.csv', index=False, sep=';')